{
  "home": "Startseite",
  "about": "Über mich",
  "projects": "Projekte",
  "education": "Bildung",
  "experience": "Erfahrung",
  "contact": "Kontakt",
  "welcome": "Willkommen in meinem Portfolio",
  "description": "Hallo, ich bin Daniil Krizhanovskyi, ein engagierter Rust-Entwickler und Forscher im Bereich Quantencomputing mit umfassender Erfahrung in Backendsystemen, Kryptographie und modernen Computing-Technologien. Entdecken Sie meine Arbeit und erfahren Sie mehr über meinen Weg in der Technikwelt sowie über meine Beiträge zur modernen Forschung und Entwicklung.",
  "learn_more": "Mehr über mich erfahren",
  "about_me": "Über mich",
  "about_description": "Ich bin ein leidenschaftlicher Rust-Entwickler und Forscher im Bereich Quantencomputing mit einem starken Hintergrund in der Backend-Entwicklung und Kryptographie. Seit Oktober 2023 habe ich mich vollständig auf die Backend-Entwicklung und die Quantenforschung spezialisiert und dabei Expertise in der Rust-Programmierung und Quanten-Technologien erworben.",
  "skill_java": "Java-Entwicklung",
  "skill_spring": "Spring-Framework",
  "skill_microservices": "Microservices-Architektur",
  "skill_db": "Datenbankverwaltung",
  "skill_rest": "RESTful APIs",
  "skill_docker": "Docker",
  "skill_ci": "CI/CD (Jenkins, GitLab CI)",
  "skill_testing": "Unit Testing (JUnit, Mockito)",
  "skill_security": "Sicherheitspraktiken (Spring Security)",
  "skill_cloud": "Cloud-Plattformen (AWS, Google Cloud, Azure)",
  "skill_rust": "Rust-Programmierung",
  "skill_quantum": "Quantencomputing (Qiskit, Quantenalgorithmen)",
  "skill_math": "Angewandte Mathematik und Kryptographie",
  "projects_title": "Projekte",
  "project_travel_title": "Reiseführer-Backend-System",
  "project_travel_duration": "Oktober 2022 - März 2023",
  "project_travel_description": "Entwickelte ein Backend-System für eine Reiseführer-Anwendung, die den Benutzern detaillierte Informationen zu verschiedenen Reisezielen bietet.",
  "technologies_used": "Verwendete Technologien:",
  "responsibilities": "Verantwortlichkeiten:",
  "project_blockchain_title": "Blockchain auf Go",
  "project_blockchain_duration": "Mai 2024 - Juni 2024",
  "project_blockchain_description": "Implementierte eine Blockchain von Grund auf in Go unter Verwendung des Proof of Stake (PoS) Konsensalgorithmus. Das Projekt umfasst Funktionalitäten wie Blockerstellung, Transaktionsabwicklung und Blockvalidierung.",
  "project_transport_title": "Analyse der öffentlichen Verkehrsnutzung",
  "project_transport_duration": "März 2020 - Juni 2020",
  "project_transport_description": "Analysierte und visualisierte die Nutzung des öffentlichen Verkehrs in verschiedenen Regionen der Schweiz mithilfe von Datenwissenschaftstechniken.",
  "project_quantum_toolkit_title": "Toolkit für Quantenkryptographie",
  "project_quantum_toolkit_duration": "Januar 2024 - Gegenwart",
  "project_quantum_toolkit_description": "Entwicklung eines umfassenden Toolkits für Quantenkryptographie, einschließlich Protokollen zur Quanten-Schlüsselverteilung (QKD) und post-quantenkryptographischen Algorithmen. Das Toolkit ist für den Einsatz in sicheren Quantenkommunikationssystemen konzipiert.",
  "project_rust_microservices_title": "Microservices-Architektur mit Rust",
  "project_rust_microservices_duration": "Juli 2022 - Oktober 2023",
  "project_rust_microservices_description": "Entwickelte und optimierte eine Microservices-Architektur für ein verteiltes System mit Rust. Der Schwerpunkt lag auf Leistung, Sicherheit und Skalierbarkeit, um den Anforderungen hochbelasteter Anwendungen gerecht zu werden.",
  "project_quantum_vqe_title": "Quantum VQE Projekt",
  "project_quantum_vqe_duration": "September 2023 - Dezember 2023",
  "project_quantum_vqe_description": "Implementierte und optimierte den Variational Quantum Eigensolver (VQE) Algorithmus für Quantenchemie-Simulationen, mit Schwerpunkt auf der Berechnung von Energieniveaus für Molekularstrukturen.",
  "project_crypto_comparison_title": "Vergleich von kryptographischen Algorithmen",
  "project_crypto_comparison_duration": "Februar 2023 - April 2023",
  "project_crypto_comparison_description": "Eine vergleichende Analyse klassischer und post-quantenkryptographischer Algorithmen mit Fokus auf Leistungsmetriken, Sicherheitsbewertungen und Berechnungseffizienz.",
  "education_title": "Bildung",
  "degree_bachelor": "Bachelor-Abschluss, Software Engineering",
  "degree_master": "Master-Abschluss, Informatik",
  "degree_master_applied": "Master-Abschluss, Angewandte Mathematik",
  "degree_master_information": "Master-Abschluss, Informationssysteme und Technologien",
  "bachelor_description": "Abgeschlossen mit einem Bachelor-Abschluss in Software Engineering. Studierte Kernfächer wie Softwareentwicklung, Testen und Wartung sowie Projektmanagement und Datenbankdesign. Mitglied des wissenschaftlichen Klubs, freiwilliger Helfer bei IT-Konferenzen.",
  "master_description": "Abgeschlossen mit einem Master-Abschluss in Informatik. Das Programm behandelte fortgeschrittene Themen wie maschinelles Lernen, künstliche Intelligenz, Datenanalyse und Softwareentwicklung. Aktiv an Forschung beteiligt und Mitglied des wissenschaftlichen Klubs, freiwilliger Helfer bei IT-Konferenzen.",
  "master_applied_description": "Abgeschlossen mit einem Master-Abschluss in Angewandter Mathematik. Der Schwerpunkt lag auf mathematischer Modellierung, Berechnungsalgorithmen und deren Anwendungen in Kryptographie und Datenanalyse. Teilnahme an verschiedenen Forschungsprojekten, einschließlich der Entwicklung von Quantenalgorithmen und mathematischen Modellen für sichere Kommunikation.",
  "master_information_description": "Abgeschlossen mit einem Master-Abschluss in Informationssystemen und Technologien. Der Lehrplan betonte fortgeschrittene Themen wie Informationssystemdesign, Datenbankverwaltung, Cybersicherheit und die Integration neuer Technologien. Intensive Forschung und Entwicklung, mit Beiträgen zu mehreren akademischen Publikationen.",
  "gpa": "GPA:",
  "skills": "Fähigkeiten:",
  "contact_title": "Kontakt",
  "contact_description": "Sie können mich gerne über eine der folgenden Plattformen erreichen:",
  "email": "E-Mail: daniil.krizhanovskyi@hotmail.com",
  "linkedin": "LinkedIn",
  "github": "GitHub",
  "experience_title": "Erfahrung",
  "freelance_java_title": "Freelance Java Entwickler Erfahrung",
  "freelance_java_duration": "Verschiedene Zeiträume ab 2019",
  "freelance_java_description": "Arbeitete an verschiedenen freiberuflichen Projekten mit Schwerpunkt auf Java-Backend-Entwicklung. Sammelte Erfahrung im Aufbau von RESTful APIs, der Verwaltung von Datenbanken und der Bereitstellung von Anwendungen mit Docker.",
  "billing_media_title": "Billing.media Ukraine",
  "position": "Position:",
  "billing_media_description": "Arbeitete an der Entwicklung von Java-basierten Anwendungen und nahm am gesamten Softwareentwicklungszyklus teil.",
  "independent_researcher_title": "Unabhängiger Forscher",
  "independent_researcher_duration": "August 2024 - Gegenwart",
  "independent_researcher_description": "Als unabhängiger Forscher spezialisiere ich mich auf die Entwicklung und Erforschung fortschrittlicher Techniken der Quantenkryptographie. Derzeit liegt mein Schwerpunkt auf der Entwicklung von Quantenverschlüsselungsalgorithmen, die die Prinzipien der Quantenmechanik, wie Superposition und Verschränkung, nutzen, um Sicherheitsniveaus zu erreichen, die mit klassischen Verschlüsselungsmethoden nicht erreichbar sind.",
  "rust_developer_title": "Rust-Entwickler",
  "rust_developer_duration": "Januar 2021 - November 2021",
  "rust_developer_description": "Arbeitete als Rust-Entwickler mit dem Fokus auf den Aufbau und die Optimierung von Backendsystemen für Kunden aus verschiedenen Branchen. Bietete IT-Beratungsdienste für Startups an und unterstützte sie bei der Einführung von Rust für ihre kritischen Systeme.",
  "junior_rust_developer_title": "Junior Rust-Entwickler",
  "junior_rust_developer_duration": "Oktober 2019 - Dezember 2020",
  "junior_rust_developer_description": "Begann als Junior Rust-Entwickler mit dem Fokus auf den Aufbau und die Wartung von Backend-Komponenten unter Verwendung von Rust. Arbeitete eng mit Senior-Entwicklern zusammen, um Funktionen zu implementieren, Code zu debuggen und die Leistung zu optimieren.",
  "mid_rust_engineer_title": "Mid+ Rust Ingenieur",
  "mid_rust_engineer_duration": "Juli 2022 - Oktober 2023",
  "mid_rust_engineer_description": "Diente als Mid+ Rust Ingenieur und leitete das Design und die Entwicklung von Schlüsselkomponenten in verteilten Systemen und Cloud-nativen Anwendungen. Arbeitete eng mit leitenden Ingenieuren zusammen, um den Code zu optimieren und hohe Leistung und Skalierbarkeit sicherzustellen.",
  "backend_developer_rust_title": "Backend-Entwickler - Rust",
  "backend_developer_rust_duration": "Oktober 2023 - Gegenwart",
  "backend_developer_rust_description": "Als Backend-Entwickler mit Spezialisierung auf Rust konzentriere ich mich auf den Aufbau sicherer und effizienter Backendsysteme, das Design und die Implementierung von Microservices, die Optimierung leistungsintensiver Anwendungen und die Sicherstellung einer hohen Codequalität durch rigorose Tests und Code-Reviews."
}
