{
    "home": "Startseite",
    "about": "Über mich",
    "projects": "Projekte",
    "education": "Bildung",
    "experience": "Erfahrung",
    "contact": "Kontakt",
    "welcome": "Willkommen in meinem Portfolio",
    "description": "Hallo, ich bin Daniil Krizhanovskyi, ein leidenschaftlicher Java Backend Entwickler mit Erfahrung in freiberuflichen und Praktikumsprojekten. Entdecken Sie meine Arbeit und erfahren Sie mehr über meinen Weg in der Technikwelt.",
    "learn_more": "Mehr über mich erfahren",
    "about_me": "Über mich",
    "about_description": "Mit über 5 Jahren Erfahrung in der Gastronomie und einem starken Hintergrund in der Backend-Entwicklung bringe ich eine einzigartige Perspektive in die Softwareentwicklung ein. Im Oktober 2023 bin ich vollständig in die Backend-Entwicklung übergegangen und habe praktische Erfahrungen in verschiedenen Projekten gesammelt und meine Fähigkeiten in Java und verwandten Technologien verbessert.",
    "skill_java": "Java-Entwicklung",
    "skill_spring": "Spring-Framework",
    "skill_microservices": "Microservices-Architektur",
    "skill_db": "Datenbankverwaltung",
    "skill_rest": "RESTful APIs",
    "skill_docker": "Docker",
    "skill_ci": "CI/CD (Jenkins, GitLab CI)",
    "skill_testing": "Unit Testing (JUnit, Mockito)",
    "skill_security": "Sicherheitspraktiken (Spring Security)",
    "skill_cloud": "Cloud-Plattformen (AWS, Google Cloud, Azure)",
    "projects_title": "Projekte",
    "project_travel_title": "Reiseführer-Backend-System",
    "project_travel_duration": "Oktober 2022 - März 2023",
    "project_travel_description": "Entwickelte ein Backend-System für eine Reiseführer-Anwendung, die den Benutzern detaillierte Informationen zu verschiedenen Reisezielen bietet.",
    "technologies_used": "Verwendete Technologien:",
    "responsibilities": "Verantwortlichkeiten:",
    "project_blockchain_title": "Blockchain auf Go",
    "project_blockchain_duration": "Februar 2021 - Juni 2021",
    "project_blockchain_description": "Dieses Projekt implementiert eine Blockchain, die in Go unter Verwendung des Proof of Stake (PoS) Konsensalgorithmus geschrieben wurde. Es umfasst grundlegende Blockchain-Funktionalitäten wie Blockerstellung, Transaktionsabwicklung und automatische Blockaddition.",
    "project_transport_title": "Analyse der öffentlichen Verkehrsnutzung",
    "project_transport_duration": "März 2020 - Juni 2020",
    "project_transport_description": "Analysierte und visualisierte die Nutzung des öffentlichen Verkehrs in verschiedenen Regionen der Schweiz mithilfe von Datenwissenschaftstechniken.",
    "education_title": "Bildung",
    "degree_bachelor": "Bachelor-Abschluss, Software Engineering",
    "degree_master": "Master-Abschluss, Informatik",
    "bachelor_description": "Abgeschlossen mit einem Bachelor-Abschluss in Software Engineering. Studierte Kernfächer wie Softwareentwicklung, Testen und Wartung sowie Projektmanagement und Datenbankdesign. Mitglied des wissenschaftlichen Klubs, freiwilliger Helfer bei IT-Konferenzen.",
    "master_description": "Abgeschlossen mit einem Master-Abschluss in Informatik. Das Programm behandelte fortgeschrittene Themen wie maschinelles Lernen, künstliche Intelligenz, Datenanalyse und Softwareentwicklung. Aktiv an Forschung beteiligt und Mitglied des wissenschaftlichen Klubs, freiwilliger Helfer bei IT-Konferenzen.",
    "gpa": "GPA:",
    "skills": "Fähigkeiten:",
    "contact_title": "Kontakt",
    "contact_description": "Sie können mich gerne über eine der folgenden Plattformen erreichen:",
    "email": "E-Mail: dkrizhanovskyi@example.com",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "experience_title": "Erfahrung",
    "freelance_java_title": "Freelance Java Entwickler Erfahrung",
    "freelance_java_duration": "Verschiedene Zeiträume ab 2019",
    "freelance_java_description": "Arbeitete an verschiedenen freiberuflichen Projekten mit Schwerpunkt auf Java-Backend-Entwicklung. Sammelte Erfahrung im Aufbau von RESTful APIs, der Verwaltung von Datenbanken und der Bereitstellung von Anwendungen mit Docker.",
    "billing_media_title": "Billing.media Ukraine",
    "position": "Position:",
    "billing_media_description": "Arbeitete an der Entwicklung von Java-basierten Anwendungen und nahm am gesamten Softwareentwicklungszyklus teil."

  }
  