{
  "home": "Home",
  "about": "About",
  "projects": "Projects",
  "education": "Education",
  "experience": "Experience",
  "contact": "Contact",
  "welcome": "Welcome to My Portfolio",
  "description": "Hi, I'm Daniil Krizhanovskyi, a dedicated Rust Developer and Quantum Computing Researcher with extensive experience in backend systems, cryptography, and advanced computing technologies. Explore my work to learn more about my journey in the tech world and my contributions to cutting-edge research and development.",
  "learn_more": "Learn More About Me",
  "about_me": "About Me",
  "about_description": "I am a passionate Rust Developer and Quantum Computing Researcher with a strong background in backend development and cryptography. Since October 2023, I have fully transitioned to backend development and quantum research, gaining expertise in Rust programming and quantum technologies.",
  "skill_java": "Java Development",
  "skill_spring": "Spring Framework",
  "skill_microservices": "Microservices Architecture",
  "skill_db": "Database Management",
  "skill_rest": "RESTful APIs",
  "skill_docker": "Docker",
  "skill_ci": "CI/CD (Jenkins, GitLab CI)",
  "skill_testing": "Unit Testing (JUnit, Mockito)",
  "skill_security": "Security Practices (Spring Security)",
  "skill_cloud": "Cloud Platforms (AWS, Google Cloud, Azure)",
  "skill_rust": "Rust Programming",
  "skill_quantum": "Quantum Computing (Qiskit, Quantum Algorithms)",
  "skill_math": "Applied Mathematics and Cryptography",
  "projects_title": "Projects",
  "project_travel_title": "Travel Guide Backend System",
  "project_travel_duration": "October 2022 - March 2023",
  "project_travel_description": "Developed a backend system for a travel guide application, aimed at providing users with detailed information about various travel destinations.",
  "technologies_used": "Technologies Used:",
  "responsibilities": "Responsibilities:",
  "project_blockchain_title": "Blockchain on Go",
  "project_blockchain_duration": "May 2024 - June 2024",
  "project_blockchain_description": "Implemented a blockchain from scratch in Go, utilizing the Proof of Stake (PoS) consensus algorithm. The project includes functionalities such as block creation, transaction handling, and block validation.",
  "project_transport_title": "Public Transport Usage Analysis",
  "project_transport_duration": "March 2020 - June 2020",
  "project_transport_description": "Analyzed and visualized public transport usage across various regions of Switzerland using data science techniques.",
  "project_quantum_toolkit_title": "Quantum Cryptographic Toolkit",
  "project_quantum_toolkit_duration": "January 2024 - Present",
  "project_quantum_toolkit_description": "Development of a comprehensive toolkit for quantum cryptography, including quantum key distribution (QKD) protocols and post-quantum cryptographic algorithms. The toolkit is designed for use in secure quantum communication systems.",
  "project_rust_microservices_title": "Microservices Architecture with Rust",
  "project_rust_microservices_duration": "July 2022 - October 2023",
  "project_rust_microservices_description": "Built and optimized a microservices architecture for a distributed system using Rust. Focused on performance, security, and scalability to meet the needs of high-demand applications.",
  "project_quantum_vqe_title": "Quantum VQE Project",
  "project_quantum_vqe_duration": "September 2023 - December 2023",
  "project_quantum_vqe_description": "Implemented and optimized the Variational Quantum Eigensolver (VQE) algorithm for quantum chemistry simulations, focusing on energy level calculations for molecular structures.",
  "project_crypto_comparison_title": "Cryptographic Algorithm Comparison",
  "project_crypto_comparison_duration": "February 2023 - April 2023",
  "project_crypto_comparison_description": "A comparative analysis of classical and post-quantum cryptographic algorithms, focusing on performance metrics, security evaluations, and computational efficiency.",
  "education_title": "Education",
  "degree_bachelor": "Bachelor's degree, Software Engineering",
  "degree_master": "Master's degree, Computer Science",
  "degree_master_applied": "Master's degree, Applied Mathematics",
  "degree_master_information": "Master's degree, Information Systems and Technologies",
  "bachelor_description": "Graduated with a Bachelor's degree in Software Engineering. Studied core subjects such as software development, testing, and maintenance, along with project management and database design. Member of the scientific club, volunteer at IT conferences.",
  "master_description": "Graduated with a Master's degree in Computer Science. The program covered advanced topics such as machine learning, artificial intelligence, data analysis, and software development. Actively participated in research and was a member of the scientific club, volunteer at IT conferences.",
  "master_applied_description": "Graduated with a Master's degree in Applied Mathematics. Focused on mathematical modeling, computational algorithms, and their applications in cryptography and data analysis. Participated in various research projects, including the development of quantum algorithms and mathematical models for secure communication.",
  "master_information_description": "Completed a Master's degree in Information Systems and Technologies. The curriculum emphasized advanced topics in information systems design, database management, cybersecurity, and the integration of emerging technologies. Engaged in extensive research and development, contributing to multiple academic publications.",
  "gpa": "GPA:",
  "skills": "Skills:",
  "contact_title": "Contact",
  "contact_description": "Feel free to reach out to me through any of the platforms below:",
  "email": "Email: daniil.krizhanovskyi@hotmail.com",
  "linkedin": "LinkedIn",
  "github": "GitHub",
  "experience_title": "Experience",
  "freelance_java_title": "Freelance Java Developer Experience",
  "freelance_java_duration": "Various periods from 2019",
  "freelance_java_description": "Worked on various freelance projects focusing on Java backend development. Gained experience in building RESTful APIs, managing databases, and deploying applications using Docker.",
  "billing_media_title": "Billing.media Ukraine",
  "position": "Position:",
  "billing_media_description": "Worked on developing Java-based applications and participated in the full software development lifecycle.",
  "independent_researcher_title": "Independent Researcher",
  "independent_researcher_duration": "August 2024 - Present",
  "independent_researcher_description": "As an Independent Researcher, I specialize in the development and exploration of advanced quantum cryptography techniques. My current focus is on designing quantum encryption algorithms that leverage the principles of quantum mechanics, such as superposition and entanglement, to achieve levels of security unattainable by classical encryption methods.",
  "rust_developer_title": "Rust Developer",
  "rust_developer_duration": "January 2021 - November 2021",
  "rust_developer_description": "Worked as a Rust Developer focusing on building and optimizing backend systems for clients in various industries. Provided IT consulting services to startups, assisting them with adopting Rust for their critical systems.",
  "junior_rust_developer_title": "Junior Rust Developer",
  "junior_rust_developer_duration": "October 2019 - December 2020",
  "junior_rust_developer_description": "Started as a Junior Rust Developer, focusing on building and maintaining backend components using Rust. Worked closely with senior developers to implement features, debug code, and optimize performance.",
  "mid_rust_engineer_title": "Mid+ Rust Engineer",
  "mid_rust_engineer_duration": "July 2022 - October 2023",
  "mid_rust_engineer_description": "Served as a Mid+ Rust Engineer, leading the design and development of key components in distributed systems and cloud-native applications. Worked closely with senior engineers to optimize code and ensure high performance and scalability.",
  "backend_developer_rust_title": "Backend Developer - Rust",
  "backend_developer_rust_duration": "October 2023 - Present",
  "backend_developer_rust_description": "As a Backend Developer specializing in Rust, I focus on building secure and efficient backend systems, designing and implementing microservices, optimizing performance-critical applications, and ensuring high code quality through rigorous testing and code reviews."
}
