{
  "home": "Головна",
  "about": "Про мене",
  "projects": "Проекти",
  "education": "Освіта",
  "experience": "Досвід",
  "contact": "Контакти",
  "welcome": "Ласкаво просимо до мого портфоліо",
  "description": "Привіт, я Даніїл Крижановський, відданий розробник на Rust і дослідник у сфері квантових обчислень з великим досвідом роботи з бекенд-системами, криптографією та сучасними обчислювальними технологіями. Досліджуйте мої роботи, щоб дізнатися більше про мій шлях у світі технологій та мої внески у передові дослідження та розробки.",
  "learn_more": "Дізнатися більше про мене",
  "about_me": "Про мене",
  "about_description": "Я є пристрасним розробником на Rust та дослідником у сфері квантових обчислень з потужним бекенд-досвідом та знаннями у криптографії. З жовтня 2023 року я повністю зосередився на бекенд-розробці та квантових дослідженнях, здобуваючи експертизу у програмуванні на Rust та квантових технологіях.",
  "skill_java": "Розробка Java",
  "skill_spring": "Spring Framework",
  "skill_microservices": "Архітектура мікросервісів",
  "skill_db": "Управління базами даних",
  "skill_rest": "RESTful APIs",
  "skill_docker": "Docker",
  "skill_ci": "CI/CD (Jenkins, GitLab CI)",
  "skill_testing": "Модульне тестування (JUnit, Mockito)",
  "skill_security": "Практики безпеки (Spring Security)",
  "skill_cloud": "Хмарні платформи (AWS, Google Cloud, Azure)",
  "skill_rust": "Програмування на Rust",
  "skill_quantum": "Квантові обчислення (Qiskit, квантові алгоритми)",
  "skill_math": "Прикладна математика та криптографія",
  "projects_title": "Проекти",
  "project_travel_title": "Система бекенду для путівника",
  "project_travel_duration": "Жовтень 2022 - Березень 2023",
  "project_travel_description": "Розробив систему бекенду для додатку путівника, що надає користувачам детальну інформацію про різні туристичні напрямки.",
  "technologies_used": "Використані технології:",
  "responsibilities": "Обов'язки:",
  "project_blockchain_title": "Блокчейн на Go",
  "project_blockchain_duration": "Травень 2024 - Червень 2024",
  "project_blockchain_description": "Реалізував блокчейн з нуля на Go з використанням алгоритму консенсусу Proof of Stake (PoS). Проект включає функції створення блоків, обробки транзакцій та валідації блоків.",
  "project_transport_title": "Аналіз використання громадського транспорту",
  "project_transport_duration": "Березень 2020 - Червень 2020",
  "project_transport_description": "Аналізував та візуалізував використання громадського транспорту у різних регіонах Швейцарії за допомогою технік аналізу даних.",
  "project_quantum_toolkit_title": "Набір інструментів для квантової криптографії",
  "project_quantum_toolkit_duration": "Січень 2024 - дотепер",
  "project_quantum_toolkit_description": "Розробка комплексного набору інструментів для квантової криптографії, включаючи протоколи квантового розподілу ключів (QKD) та постквантові криптографічні алгоритми. Набір інструментів призначений для використання у безпечних системах квантового зв'язку.",
  "project_rust_microservices_title": "Архітектура мікросервісів на Rust",
  "project_rust_microservices_duration": "Липень 2022 - Жовтень 2023",
  "project_rust_microservices_description": "Створив та оптимізував архітектуру мікросервісів для розподіленої системи на Rust. Основна увага приділялася продуктивності, безпеці та масштабованості для задоволення потреб високонавантажених додатків.",
  "project_quantum_vqe_title": "Проект Quantum VQE",
  "project_quantum_vqe_duration": "Вересень 2023 - Грудень 2023",
  "project_quantum_vqe_description": "Реалізував та оптимізував алгоритм Variational Quantum Eigensolver (VQE) для симуляцій квантової хімії, зосереджуючись на розрахунку рівнів енергії для молекулярних структур.",
  "project_crypto_comparison_title": "Порівняння криптографічних алгоритмів",
  "project_crypto_comparison_duration": "Лютий 2023 - Квітень 2023",
  "project_crypto_comparison_description": "Порівняльний аналіз класичних та постквантових криптографічних алгоритмів, зосереджуючи увагу на показниках продуктивності, оцінках безпеки та обчислювальній ефективності.",
  "education_title": "Освіта",
  "degree_bachelor": "Бакалавр, Програмна інженерія",
  "degree_master": "Магістр, Комп'ютерні науки",
  "degree_master_applied": "Магістр, Прикладна математика",
  "degree_master_information": "Магістр, Інформаційні системи та технології",
  "bachelor_description": "Отримав ступінь бакалавра з програмної інженерії. Вивчав основні предмети, такі як розробка програмного забезпечення, тестування та обслуговування, а також управління проектами та проектування баз даних. Член наукового клубу, волонтер на ІТ-конференціях.",
  "master_description": "Отримав ступінь магістра з комп'ютерних наук. Програма охоплювала розширені теми, такі як машинне навчання, штучний інтелект, аналіз даних та розробка програмного забезпечення. Активно брав участь у наукових дослідженнях і був членом наукового клубу, волонтер на ІТ-конференціях.",
  "master_applied_description": "Отримав ступінь магістра з прикладної математики. Основна увага приділялася математичному моделюванню, обчислювальним алгоритмам та їх застосуванню у криптографії та аналізі даних. Брав участь у різних наукових проектах, включаючи розробку квантових алгоритмів та математичних моделей для забезпечення безпеки зв'язку.",
  "master_information_description": "Отримав ступінь магістра з інформаційних систем та технологій. Навчальний план підкреслював розширені теми, такі як проектування інформаційних систем, управління базами даних, кібербезпека та інтеграція нових технологій. Брав активну участь у дослідженнях та розробках, сприяючи створенню численних академічних публікацій.",
  "gpa": "Середній бал:",
  "skills": "Навички:",
  "contact_title": "Контакти",
  "contact_description": "Зв'яжіться зі мною через будь-яку з платформ нижче:",
  "email": "Електронна пошта: daniil.krizhanovskyi@hotmail.com",
  "linkedin": "LinkedIn",
  "github": "GitHub",
  "experience_title": "Досвід",
  "freelance_java_title": "Досвід фріланс-розробника на Java",
  "freelance_java_duration": "Різні періоди з 2019 року",
  "freelance_java_description": "Працював над різними фріланс-проектами з акцентом на розробку бекенду на Java. Набув досвіду у створенні RESTful API, управлінні базами даних та розгортанні додатків за допомогою Docker.",
  "billing_media_title": "Billing.media Ukraine",
  "position": "Посада:",
  "billing_media_description": "Працював над розробкою додатків на базі Java та брав участь у повному життєвому циклі розробки програмного забезпечення.",
  "independent_researcher_title": "Незалежний дослідник",
  "independent_researcher_duration": "Серпень 2024 - дотепер",
  "independent_researcher_description": "Як незалежний дослідник я спеціалізуюсь на розробці та дослідженні передових методів квантової криптографії. Мій поточний фокус - розробка квантових алгоритмів шифрування, що використовують принципи квантової механіки, такі як суперпозиція та заплутаність, для досягнення рівнів безпеки, недосяжних класичними методами шифрування.",
  "rust_developer_title": "Розробник на Rust",
  "rust_developer_duration": "Січень 2021 - Листопад 2021",
  "rust_developer_description": "Працював як розробник на Rust, зосереджуючись на побудові та оптимізації бекенд-систем для клієнтів з різних галузей. Надавав консультаційні ІТ-послуги стартапам, допомагаючи їм впроваджувати Rust для критичних систем.",
  "junior_rust_developer_title": "Молодший розробник на Rust",
  "junior_rust_developer_duration": "Жовтень 2019 - Грудень 2020",
  "junior_rust_developer_description": "Почав як молодший розробник на Rust, зосереджуючись на створенні та підтримці бекенд-компонентів на Rust. Тісно співпрацював з досвідченими розробниками для впровадження функцій, налагодження коду та оптимізації продуктивності.",
  "mid_rust_engineer_title": "Mid+ інженер на Rust",
  "mid_rust_engineer_duration": "Липень 2022 - Жовтень 2023",
  "mid_rust_engineer_description": "Працював як Mid+ інженер на Rust, керуючи дизайном та розробкою ключових компонентів у розподілених системах та хмарно-орієнтованих додатках. Тісно співпрацював з досвідченими інженерами для оптимізації коду та забезпечення високої продуктивності та масштабованості.",
  "backend_developer_rust_title": "Бекенд-розробник - Rust",
  "backend_developer_rust_duration": "Жовтень 2023 - дотепер",
  "backend_developer_rust_description": "Як бекенд-розробник зі спеціалізацією на Rust, я зосереджуюсь на створенні безпечних та ефективних бекенд-систем, проектуванні та впровадженні мікросервісів, оптимізації продуктивних додатків та забезпеченні високої якості коду через ретельне тестування та огляд коду."
}
